#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>

//int main()
//{
//	int n = 9;
//	//[00000000000000000000000000001001]
//	//0 00000000 00000000000000000001001
//	//E=-126
//	//M=0.00000000000000000001001
//	//+ 0.00000000000000000001001* 2^-126
//	//
//	float* pFloat = (float*)&n;
//	printf("n的值为:%d\n", n);
//	printf("*pFloat的值为: %f\n", *pFloat);
//	*pFloat = 9.0;
//	//1001.0
//	//1.0011*2^3
//	//S=0 E=3 M=1.001
//	//0 10000010 00100000000000000000000
//	//
//	printf("num的值为:%d\n", n);
//	printf("*pFloat的值为:%f\n", *pFloat);
//
//	return 0;
//}




